r"""
创建者: 阿斗是只猫
创建日期: 2025-04-09
最后编辑人: 阿斗是只猫
最后编辑时间: 2025-04-13
说明:

    如有问题或建议，请联系微信公众号：【阿斗的小窝】

    Copyright (c) 2025 by 阿斗是只猫, All Rights Reserved.
"""

import sys
from pathlib import Path

####################################常量#############################################
常量_标题: str = "阿斗附图标记辅助 V1.0"
常量_项目名: str = "标注.db"
常量_后缀_最大: int = 20  # 最多有20个后缀，即零件名最多20个同

# ************颜色************
常量_颜色: dict = {"一级": "#A5DEE5", "二级": "#FFBCBC", "三极": "#F6EAC2", "四级": "#C1E1C1"}

# ************不同等级变量名的位置************
常量_默认位置: int = 20
常量_累加: int = 20
常量_一级_位置: int = 常量_默认位置
常量_二级_位置: int = 常量_默认位置 + 常量_累加
常量_三极_位置: int = 常量_默认位置 + 常量_累加 * 2
常量_四级_位置: int = 常量_默认位置 + 常量_累加 * 3

####################################获取程序根目录#############################################
常量_路径 = None

if getattr(sys, "frozen", False) and hasattr(sys, "_MEIPASS"):
    # pyinstaller 打包的exe运行时，走这里
    常量_路径 = Path(sys.executable).parent
    常量_路径 = 常量_路径 / Path("_internal")
else:
    # 非 pyinstaller 执行
    常量_路径 = Path(__file__).parent.resolve()


####################################位码及后缀#############################################
常量_第一位 = ["1", "2", "3", "4", "5", "6", "7", "8", "9"]
常量_第二位 = ["", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
常量_第三位 = ["", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"]
常量_第四位 = [
    ["", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"],
    [
        "",
        "a",
        "b",
        "c",
        "d",
        "e",
        "f",
        "g",
        "h",
        "i",
        "j",
        "k",
        "l",
        "m",
        "n",
        "o",
        "p",
        "q",
        "r",
        "s",
        "t",
        "u",
        "v",
        "w",
        "x",
        "y",
        "z",
    ],
    [
        "",
        "A",
        "B",
        "C",
        "D",
        "E",
        "F",
        "G",
        "H",
        "I",
        "J",
        "K",
        "L",
        "M",
        "N",
        "O",
        "P",
        "Q",
        "R",
        "S",
        "T",
        "U",
        "V",
        "W",
        "X",
        "Y",
        "Z",
    ],
]

常量_后缀 = [
    [
        "一",
        "二",
        "三",
        "四",
        "五",
        "六",
        "七",
        "八",
        "九",
        "十",
        "十一",
        "十二",
        "十三",
        "十四",
        "十五",
        "十六",
        "十七",
        "十八",
        "十九",
        "二十",
    ],
    [
        "Ⅰ",
        "Ⅱ",
        "Ⅲ",
        "Ⅳ",
        "Ⅴ",
        "Ⅵ",
        "Ⅶ",
        "Ⅷ",
        "Ⅸ",
        "Ⅹ",
        "Ⅺ",
        "Ⅻ",
        "XIII",
        "XIV",
        "XV",
        "XVI",
        "XVII",
        "XVIII",
        "XIX",
        "XX",
    ],
]

常量_连接符 = ["", "-"]
